k=input('Вы хотите ввести свои значения элементов схемы?\n Если да, нажмине 1\n Если нет, нажмите 0\n');
switch k
    case 1
   R11=input('Введите R11:\n R11=');
   R12=input('Введите R12:\n R12=');
   R13=input('Введите R13:\n R13=');
   R14=input('Введите R14:\n R14=');
   R21=input('Введите R21:\n R21=');
   R22=input('Введите R22:\n R22=');
   R23=input('Введите R23:\n R23=');
   R24=input('Введите R24:\n R24=');
   R31=input('Введите R31:\n R31=');
   R32=input('Введите R32:\n R32=');
   R33=input('Введите R33:\n R33=');
   R34=input('Введите R34:\n R34=');
   R41=input('Введите R41:\n R41=');
   R42=input('Введите R42:\n R42=');
   R43=input('Введите R43:\n R43=');
   R44=input('Введите R44:\n R44=');
   E11=input('Введите E11:\n E11=');
   E22=input('Введите E22:\n E22=');
   E33=input('Введите E33:\n E33=');
   E44=input('Введите E44:\n E44=');
R=[R11,R12,R13,R14;R21,R22,R23,R24;R31,R32,R33,R34;R41,R42,R43,R44]
E=[E11;E22;E33;E44]
I=inv(R)*E
I11=I(1);
I22=I(2);
I33=I(3);
I44=I(4);
I1=I11-I22;
I2=I33-I22;
I3=I11;
I4=-I22;
I5=I44-I22;
I6=I11-I33;
I7=I44;
I8=I33-I44;
U12=(I1*R1)-E1;
U25=(I2*R2)-E2;
U31=I3*R3;
U41=I4*R4;
U54=I5*R5;
U23=I6*R6;
U46=I7*R7;
U56=I8*R8;
U1=I1*R1;
U2=I2*R2;
U3=I3*R3;
U4=I4*R4;
U5=I5*R5;
U6=I6*R6;
U7=I7*R7;
U8=I8*R8;
Ik=[I1 I2 I3 I4; I5 I6 I7 I8]
Uv=[U31 U12 U23 U41; U25 U54 U56 U46]
Ur=[U1 U2 U3 U4; U5 U6 U7 U8]
case 0
R1=100;
R2=110;
R3=120;
R4=130;
R5=140;
R6=150;
R7=160;
R8=170;
E1=28;
E2=20;
R11=R3+R1+R6;
R12=-R1;
R13=-R6;
R14=0;
R22=R1+R2+R4+R5;
R21=-R1;
R23=-R2;
R24=-R5;
R33=R6+R2+R8;
R31=-R6;
R32=-R2;
R34=-R8;
R44=R5+R8+R7;
R41=0;
R42=-R5;
R43=-R8;
E11=E1;
E22=-E1-E2;
E33=E2;
E44=0;
R=[R11,R12,R13,R14;R21,R22,R23,R24;R31,R32,R33,R34;R41,R42,R43,R44]
E=[E11;E22;E33;E44]
I=inv(R)*E
I11=I(1);
I22=I(2);
I33=I(3);
I44=I(4);
I1=I11-I22;
I2=I33-I22;
I3=I11;
I4=-I22;
I5=I44-I22;
I6=I11-I33;
I7=I44;
I8=I33-I44;
U12=(I1*R1)-E1;
U25=(I2*R2)-E2;
U31=I3*R3;
U41=I4*R4;
U54=I5*R5;
U23=I6*R6;
U46=I7*R7;
U56=I8*R8;
U1=I1*R1;
U2=I2*R2;
U3=I3*R3;
U4=I4*R4;
U5=I5*R5;
U6=I6*R6;
U7=I7*R7;
U8=I8*R8;
Ik=[I1 I2 I3 I4; I5 I6 I7 I8]
Uv=[U31 U12 U23 U41; U25 U54 U56 U46]
Ur=[U1 U2 U3 U4; U5 U6 U7 U8]
otherwise
input('ВЫ ВВЕЛИ НЕ ВЕРНЫЙ СИМВОЛ!!!');
end
